---
kind: other
id: Properties.T:Autodesk.Revit.DB.Electrical.CircuitNamingScheme
source: html/78262d13-0206-ffe4-af49-7b178a33df2e.htm
---
# CircuitNamingScheme Properties

The id of the assembly instance to which the element belongs.